app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function getData()
    {
        $userModel  =   new UserModel();
        $data       =   $userModel->asObject()->findAll();